AIDevelopersMonster/ESP32-8048S043-lab/libraries/ESP32_8048S043/examples/10_LVGL_BasicUI/10_LVGL_BasicUI.ino
/*
  ESP32-8048S043 Lab / 10_LVGL_BasicUI

  Author:
    Alex Malachevsky

  Project GitHub:
    https://github.com/AIDevelopersMonster/ESP32-8048S043-lab

  Purpose:
    First LVGL UI test for the ESP32-8048S043 board after the hardware layers
    have been validated separately:
      01 BoardInfo / profile / PSRAM
      02 RGB display
      03 GT911 touch
      04 Backlight
      05 TestConsole
      06 Wi-Fi
      07 WebServer
      08 SDCard read-only
      09 BLE scan

  What this example checks:
    - Arduino_GFX RGB display driver under LVGL;
    - LVGL draw buffer allocation, preferably in PSRAM;
    - LVGL flush callback to the 800x480 RGB panel;
    - direct GT911 polling bridged into LVGL pointer input;
    - interactive button + counter;
    - slider-controlled backlight PWM;
    - runtime ALIVE lines while LVGL is active.

  What this example does NOT check:
    - SD-backed assets;
    - Web upload/control;
    - Widget Runtime;
    - GitHub OTA;
    - long-duration HMI stress;
    - final UI framework architecture.

  Dependencies:
    - Arduino_GFX_Library by moononournation;
    - LVGL 8.x from Arduino Library Manager.

  LVGL boundary:
    This example is intentionally written for LVGL 8.x. It is the first small
    local HMI shell, not yet the final Widget Runtime architecture.
*/

#include <Arduino.h>
#include <Wire.h>
#include <math.h>
#include <lvgl.h>
#include <Arduino_GFX_Library.h>
#include <ESP32_8048S043_Pins.h>

#include "esp_heap_caps.h"

using namespace esp32_8048s043::pins;

#if LV_COLOR_DEPTH != 16
#error "10_LVGL_BasicUI expects LV_COLOR_DEPTH == 16 for Arduino_GFX RGB565 flush. Set LVGL color depth to 16."
#endif

static constexpr int LCD_W = LCD_WIDTH;
static constexpr int LCD_H = LCD_HEIGHT;
static constexpr int LCD_PCLK_HZ = 16000000;

static constexpr uint32_t SERIAL_BAUD = 115200;
static constexpr uint32_t LVGL_BUFFER_LINES = 40;
static constexpr uint32_t LVGL_TICK_PERIOD_MS = 5;
static constexpr uint32_t ALIVE_INTERVAL_MS = 5000;
static constexpr uint32_t I2C_SPEED_HZ = 400000;
static constexpr uint32_t TOUCH_POLL_INTERVAL_MS = 15;
static constexpr uint32_t TOUCH_LOG_INTERVAL_MS = 80;
static constexpr uint32_t TOUCH_HOLD_MS = 140;

static constexpr uint16_t GT911_STATUS_REG = 0x814E;
static constexpr uint16_t GT911_POINT_REG = 0x814F;
static constexpr uint16_t GT911_PRODUCT_ID_REG = 0x8140;
static constexpr uint16_t GT911_FW_VERSION_REG = 0x8144;
static constexpr uint16_t GT911_X_RESOLUTION_REG = 0x8146;
static constexpr uint16_t GT911_Y_RESOLUTION_REG = 0x8148;

// Calibration seed proven useful in the lower-level 03_TouchGT911Test path.
// It maps GT911 raw coordinates into the current 800x480 display orientation.
static constexpr bool TOUCH_USE_CALIBRATION = true;
static constexpr float TOUCH_CAL_X_RX = 1.65867031f;
static constexpr float TOUCH_CAL_X_RY = -0.02261823f;
static constexpr float TOUCH_CAL_X_C = 2.12817001f;
static constexpr float TOUCH_CAL_Y_RX = 0.02082564f;
static constexpr float TOUCH_CAL_Y_RY = 1.79517055f;
static constexpr float TOUCH_CAL_Y_C = 10.62223816f;

static Arduino_ESP32RGBPanel *rgbPanel = nullptr;
static Arduino_RGB_Display *gfx = nullptr;

static lv_disp_draw_buf_t drawBuf;
static lv_disp_drv_t dispDrv;
static lv_indev_drv_t indevDrv;
static lv_color_t *lvBuf1 = nullptr;
static lv_color_t *lvBuf2 = nullptr;

static uint8_t touchAddr = 0;
static bool displayOk = false;
static bool touchOk = false;
static bool lvglOk = false;
static bool uiOk = false;

static uint32_t buttonClicks = 0;
static uint32_t touchReports = 0;
static uint32_t touchStatusReads = 0;
static uint32_t touchStatusReady = 0;
static uint32_t touchStatusReadFails = 0;
static uint32_t touchPointReadFails = 0;
static uint32_t lvglLoops = 0;
static uint32_t lastAliveMs = 0;
static uint32_t lastLvTickMs = 0;
static uint32_t lastTouchPollMs = 0;
static uint32_t lastTouchLogMs = 0;
static uint32_t lastTouchSeenMs = 0;
static uint8_t lastTouchStatus = 0;
static int lastRawX = -1;
static int lastRawY = -1;
static int cachedTouchX = 0;
static int cachedTouchY = 0;
static bool cachedTouchPressed = false;
static bool markerVisible = false;

static lv_obj_t *counterLabel = nullptr;
static lv_obj_t *statusLabel = nullptr;
static lv_obj_t *sliderLabel = nullptr;
static lv_obj_t *touchLabel = nullptr;
static lv_obj_t *touchMarker = nullptr;

static void printDivider() {
  Serial.println("------------------------------------------------------------");
}

static void printBuildProfile() {
  Serial.println("[BUILD PROFILE]");

#ifdef ARDUINO_BOARD
  Serial.printf("%-28s: \"%s\"\n", "ARDUINO_BOARD", ARDUINO_BOARD);
#else
  Serial.printf("%-28s: not defined\n", "ARDUINO_BOARD");
#endif

#ifdef ARDUINO_VARIANT
  Serial.printf("%-28s: \"%s\"\n", "ARDUINO_VARIANT", ARDUINO_VARIANT);
#else
  Serial.printf("%-28s: not defined\n", "ARDUINO_VARIANT");
#endif

#ifdef CONFIG_IDF_TARGET
  Serial.printf("%-28s: \"%s\"\n", "CONFIG_IDF_TARGET", CONFIG_IDF_TARGET);
#else
  Serial.printf("%-28s: not defined\n", "CONFIG_IDF_TARGET");
#endif

#ifdef CONFIG_IDF_TARGET_ESP32S3
  Serial.printf("%-28s: %d\n", "CONFIG_IDF_TARGET_ESP32S3", CONFIG_IDF_TARGET_ESP32S3);
#else
  Serial.printf("%-28s: not defined\n", "CONFIG_IDF_TARGET_ESP32S3");
#endif

#ifdef BOARD_HAS_PSRAM
  Serial.printf("%-28s: defined\n", "BOARD_HAS_PSRAM");
#else
  Serial.printf("%-28s: not defined\n", "BOARD_HAS_PSRAM");
#endif

  Serial.printf("%-28s: %d.%d.%d\n", "LVGL version", LVGL_VERSION_MAJOR, LVGL_VERSION_MINOR, LVGL_VERSION_PATCH);
  Serial.printf("%-28s: %d\n", "LV_COLOR_DEPTH", LV_COLOR_DEPTH);
}

static void printRuntimeBaseline() {
  Serial.println("[RUNTIME]");
  Serial.printf("%-28s: %s\n", "ESP-IDF SDK", ESP.getSdkVersion());
  Serial.printf("%-28s: %s rev %u\n", "Chip", ESP.getChipModel(), ESP.getChipRevision());
  Serial.printf("%-28s: %lu MHz\n", "CPU frequency", static_cast<unsigned long>(ESP.getCpuFreqMHz()));
  Serial.printf("%-28s: %lu bytes\n", "Flash", static_cast<unsigned long>(ESP.getFlashChipSize()));
  Serial.printf("%-28s: %lu bytes\n", "PSRAM", static_cast<unsigned long>(ESP.getPsramSize()));
  Serial.printf("%-28s: %lu bytes\n", "Free PSRAM", static_cast<unsigned long>(ESP.getFreePsram()));
  Serial.printf("%-28s: %lu bytes\n", "Free heap", static_cast<unsigned long>(ESP.getFreeHeap()));
}

static uint16_t le16(const uint8_t *data) {
  return static_cast<uint16_t>(data[0]) | (static_cast<uint16_t>(data[1]) << 8);
}

