AIDevelopersMonster/ESP32-8048S043-lab/libraries/ESP32_8048S043/examples/10_LVGL_BasicUI/10_LVGL_BasicUI.ino
static char printableOrDot(uint8_t value) {
  return (value >= 32 && value <= 126) ? static_cast<char>(value) : '.';
}

static bool i2cReadReg(uint8_t addr, uint16_t reg, uint8_t *buf, size_t len) {
  Wire.beginTransmission(addr);
  Wire.write(static_cast<uint8_t>(reg >> 8));
  Wire.write(static_cast<uint8_t>(reg & 0xFF));
  if (Wire.endTransmission(false) != 0) {
    return false;
  }

  const int requested = static_cast<int>(len);
  const int got = Wire.requestFrom(static_cast<int>(addr), requested, static_cast<int>(true));
  if (got != requested) {
    while (Wire.available()) {
      Wire.read();
    }
    return false;
  }

  for (size_t i = 0; i < len; ++i) {
    buf[i] = static_cast<uint8_t>(Wire.read());
  }
  return true;
}

static bool i2cWriteRegByte(uint8_t addr, uint16_t reg, uint8_t value) {
  Wire.beginTransmission(addr);
  Wire.write(static_cast<uint8_t>(reg >> 8));
  Wire.write(static_cast<uint8_t>(reg & 0xFF));
  Wire.write(value);
  return Wire.endTransmission() == 0;
}

static void gt911ClearStatus() {
  if (touchAddr != 0) {
    i2cWriteRegByte(touchAddr, GT911_STATUS_REG, 0x00);
  }
}

static void gt911Reset() {
  pinMode(TOUCH_INT, INPUT_PULLUP);
  pinMode(TOUCH_RST, OUTPUT);
  digitalWrite(TOUCH_RST, LOW);
  delay(20);
  digitalWrite(TOUCH_RST, HIGH);
  delay(120);
}

static String scanI2C() {
  String found;
  for (uint8_t addr = 1; addr < 127; ++addr) {
    Wire.beginTransmission(addr);
    if (Wire.endTransmission() == 0) {
      char tmp[8];
      snprintf(tmp, sizeof(tmp), "0x%02X ", addr);
      found += tmp;
    }
  }
  if (found.length() == 0) {
    found = "none";
  }
  return found;
}

static uint8_t findGT911() {
  const uint8_t candidates[] = {TOUCH_GT911_ADDR, TOUCH_GT911_ADDR_ALT};
  uint8_t id[4] = {};

  for (uint8_t addr : candidates) {
    if (i2cReadReg(addr, GT911_PRODUCT_ID_REG, id, sizeof(id))) {
      Serial.printf("[PASS] GT911 at 0x%02X, product id raw: %02X %02X %02X %02X\n",
                    addr, id[0], id[1], id[2], id[3]);
      Serial.printf("[INFO] GT911 product id text: %c%c%c%c\n",
                    printableOrDot(id[0]), printableOrDot(id[1]),
                    printableOrDot(id[2]), printableOrDot(id[3]));
      return addr;
    }
  }

  return 0;
}

static void printGt911Info() {
  if (touchAddr == 0) {
    return;
  }

  uint8_t fw[2] = {};
  if (i2cReadReg(touchAddr, GT911_FW_VERSION_REG, fw, sizeof(fw))) {
    Serial.printf("[INFO] GT911 FW version: 0x%04X (%u)\n", le16(fw), le16(fw));
  }

  uint8_t xres[2] = {};
  uint8_t yres[2] = {};
  if (i2cReadReg(touchAddr, GT911_X_RESOLUTION_REG, xres, sizeof(xres)) &&
      i2cReadReg(touchAddr, GT911_Y_RESOLUTION_REG, yres, sizeof(yres))) {
    Serial.printf("[INFO] GT911 resolution registers: X=%u Y=%u\n", le16(xres), le16(yres));
  } else {
    Serial.println("[INFO] GT911 resolution registers: read failed or unsupported");
  }
}

static void setBacklightDuty(uint8_t duty) {
#if ESP_ARDUINO_VERSION_MAJOR >= 3
  static bool attached = false;
  if (!attached) {
    attached = ledcAttach(BACKLIGHT, 5000, 8);
    if (!attached) {
      Serial.println("[WARN] ledcAttach() failed; using digital backlight fallback");
      pinMode(BACKLIGHT, OUTPUT);
    }
  }

  if (attached) {
    ledcWrite(BACKLIGHT, duty);
  } else {
    digitalWrite(BACKLIGHT, duty > 0 ? HIGH : LOW);
  }
#else
  static bool attached = false;
  static constexpr int channel = 0;
  if (!attached) {
    ledcSetup(channel, 5000, 8);
    ledcAttachPin(BACKLIGHT, channel);
    attached = true;
  }
  ledcWrite(channel, duty);
#endif
}

static bool initDisplay() {
  Serial.println("[DISPLAY INIT]");
  setBacklightDuty(255);

  rgbPanel = new Arduino_ESP32RGBPanel(
    RGB_DE, RGB_VSYNC, RGB_HSYNC, RGB_PCLK,
    RGB_R0, RGB_R1, RGB_R2, RGB_R3, RGB_R4,
    RGB_G0, RGB_G1, RGB_G2, RGB_G3, RGB_G4, RGB_G5,
    RGB_B0, RGB_B1, RGB_B2, RGB_B3, RGB_B4,
    1 /* hsync polarity */, 40 /* hsync front porch */, 48 /* hsync pulse width */, 40 /* hsync back porch */,
    1 /* vsync polarity */, 13 /* vsync front porch */, 3 /* vsync pulse width */, 29 /* vsync back porch */,
    1 /* pclk active neg */, LCD_PCLK_HZ /* prefer speed */
  );

  gfx = new Arduino_RGB_Display(
    LCD_W,
    LCD_H,
    rgbPanel,
    0 /* rotation */,
    true /* auto_flush */
  );

  if (!gfx->begin()) {
    Serial.println("[FAIL] gfx->begin()");
    return false;
  }

  gfx->fillScreen(0x0000);
  Serial.println("[PASS] gfx->begin()");
  return true;
}

static bool initTouch() {
  Serial.println("[TOUCH INIT]");

  // Match the proven low-level 03_TouchGT911Test sequence:
  // Wire first, then GT911 reset, then product-id probe.
  Wire.begin(TOUCH_SDA, TOUCH_SCL, I2C_SPEED_HZ);
  Serial.printf("[INFO] Wire.begin(SDA=%d, SCL=%d, %lu Hz)\n",
                TOUCH_SDA, TOUCH_SCL, static_cast<unsigned long>(I2C_SPEED_HZ));

  Serial.println("[INFO] GT911 reset: RST38 toggle, INT18 passive pull-up, polling mode");
  gt911Reset();

  touchAddr = findGT911();
  Serial.print("[INFO] I2C scan: ");
  Serial.println(scanI2C());

  if (touchAddr == 0) {
    Serial.println("[FAIL] GT911 not detected at 0x5D or 0x14");
    return false;
  }

  printGt911Info();
  gt911ClearStatus();
  return true;
}

static int clampInt(int value, int minValue, int maxValue) {
  if (value < minValue) {
    return minValue;
  }
  if (value > maxValue) {
    return maxValue;
  }
  return value;
}

static void mapTouchToScreen(uint16_t rawX, uint16_t rawY, int &screenX, int &screenY) {
  if (TOUCH_USE_CALIBRATION) {
    const float fx = TOUCH_CAL_X_RX * rawX + TOUCH_CAL_X_RY * rawY + TOUCH_CAL_X_C;
    const float fy = TOUCH_CAL_Y_RX * rawX + TOUCH_CAL_Y_RY * rawY + TOUCH_CAL_Y_C;
    screenX = clampInt(static_cast<int>(lroundf(fx)), 0, LCD_W - 1);
    screenY = clampInt(static_cast<int>(lroundf(fy)), 0, LCD_H - 1);
  } else {
    screenX = clampInt(static_cast<int>(rawX), 0, LCD_W - 1);
    screenY = clampInt(static_cast<int>(rawY), 0, LCD_H - 1);
  }
}

static bool readTouchRaw(int16_t &rawX, int16_t &rawY, uint8_t &trackId, uint16_t &touchSize, uint8_t &statusOut) {
  statusOut = 0;

  if (touchAddr == 0) {
    return false;
  }

  uint8_t status = 0;
  if (!i2cReadReg(touchAddr, GT911_STATUS_REG, &status, 1)) {
    ++touchStatusReadFails;
    return false;
  }

