AIDevelopersMonster/ESP32-8048S043-lab/libraries/ESP32_8048S043/examples/10_LVGL_BasicUI/10_LVGL_BasicUI.ino
  ++touchStatusReads;
  lastTouchStatus = status;
  statusOut = status;

  if ((status & 0x80) == 0) {
    return false;
  }

  ++touchStatusReady;

  const uint8_t points = status & 0x0F;
  if (points == 0 || points > 5) {
    Serial.printf("[TOUCH] status unusual: 0x%02X points=%u, clearing\n", status, points);
    gt911ClearStatus();
    return false;
  }

  uint8_t data[8] = {};
  const bool ok = i2cReadReg(touchAddr, GT911_POINT_REG, data, sizeof(data));
  gt911ClearStatus();

  if (!ok) {
    ++touchPointReadFails;
    return false;
  }

  trackId = data[0];
  rawX = static_cast<int16_t>(le16(&data[1]));
  rawY = static_cast<int16_t>(le16(&data[3]));
  touchSize = le16(&data[5]);

  return true;
}

static void lvglFlush(lv_disp_drv_t *disp, const lv_area_t *area, lv_color_t *colorP) {
  if (!gfx) {
    lv_disp_flush_ready(disp);
    return;
  }

  const int32_t w = area->x2 - area->x1 + 1;
  const int32_t h = area->y2 - area->y1 + 1;
  gfx->draw16bitRGBBitmap(area->x1, area->y1, reinterpret_cast<uint16_t *>(colorP), w, h);
  lv_disp_flush_ready(disp);
}

static void lvglTouchRead(lv_indev_drv_t *drv, lv_indev_data_t *data) {
  (void)drv;

  const uint32_t age = millis() - lastTouchSeenMs;
  if (cachedTouchPressed && age <= TOUCH_HOLD_MS) {
    data->state = LV_INDEV_STATE_PR;
    data->point.x = cachedTouchX;
    data->point.y = cachedTouchY;
  } else {
    data->state = LV_INDEV_STATE_REL;
    data->point.x = cachedTouchX;
    data->point.y = cachedTouchY;
  }
}

static void *allocDrawBuffer(size_t bytes, const char *name) {
  void *ptr = heap_caps_malloc(bytes, MALLOC_CAP_SPIRAM | MALLOC_CAP_8BIT);
  if (ptr) {
    Serial.printf("[PASS] %s allocated in PSRAM: %u bytes\n", name, static_cast<unsigned int>(bytes));
    return ptr;
  }

  ptr = heap_caps_malloc(bytes, MALLOC_CAP_INTERNAL | MALLOC_CAP_8BIT);
  if (ptr) {
    Serial.printf("[WARN] %s allocated in internal RAM: %u bytes\n", name, static_cast<unsigned int>(bytes));
    return ptr;
  }

  Serial.printf("[FAIL] %s allocation failed: %u bytes\n", name, static_cast<unsigned int>(bytes));
  return nullptr;
}

static bool initLvgl() {
  Serial.println("[LVGL INIT]");
  lv_init();

  const size_t pixelCount = LCD_W * LVGL_BUFFER_LINES;
  const size_t bufferBytes = pixelCount * sizeof(lv_color_t);

  lvBuf1 = static_cast<lv_color_t *>(allocDrawBuffer(bufferBytes, "lvBuf1"));
  lvBuf2 = static_cast<lv_color_t *>(allocDrawBuffer(bufferBytes, "lvBuf2"));

  if (!lvBuf1 || !lvBuf2) {
    return false;
  }

  lv_disp_draw_buf_init(&drawBuf, lvBuf1, lvBuf2, pixelCount);

  lv_disp_drv_init(&dispDrv);
  dispDrv.hor_res = LCD_W;
  dispDrv.ver_res = LCD_H;
  dispDrv.flush_cb = lvglFlush;
  dispDrv.draw_buf = &drawBuf;
  lv_disp_drv_register(&dispDrv);

  if (touchOk) {
    lv_indev_drv_init(&indevDrv);
    indevDrv.type = LV_INDEV_TYPE_POINTER;
    indevDrv.read_cb = lvglTouchRead;
    lv_indev_drv_register(&indevDrv);
    Serial.println("[PASS] LVGL touch input registered");
  } else {
    Serial.println("[WARN] LVGL touch input not registered because GT911 init failed");
  }

  lastLvTickMs = millis();
  Serial.println("[PASS] LVGL display driver registered");
  return true;
}

static void updateCounterLabel() {
  if (!counterLabel) {
    return;
  }
  lv_label_set_text_fmt(counterLabel, "Button clicks: %lu", static_cast<unsigned long>(buttonClicks));
}

static void buttonEvent(lv_event_t *event) {
  if (lv_event_get_code(event) == LV_EVENT_CLICKED) {
    ++buttonClicks;
    Serial.printf("[LVGL] Button clicked: %lu\n", static_cast<unsigned long>(buttonClicks));
    updateCounterLabel();
  }
}

static void sliderEvent(lv_event_t *event) {
  lv_obj_t *slider = lv_event_get_target(event);
  const int value = static_cast<int>(lv_slider_get_value(slider));
  setBacklightDuty(static_cast<uint8_t>(value));

  if (sliderLabel) {
    lv_label_set_text_fmt(sliderLabel, "Backlight PWM: %d / 255", value);
  }

  if (lv_event_get_code(event) == LV_EVENT_VALUE_CHANGED) {
    Serial.printf("[LVGL] Backlight slider: %d\n", value);
  }
}

static void createUi() {
  Serial.println("[UI INIT]");

  lv_obj_t *screen = lv_scr_act();
  lv_obj_set_style_bg_color(screen, lv_color_hex(0x101820), 0);

  lv_obj_t *title = lv_label_create(screen);
  lv_label_set_text(title, "ESP32-8048S043 / LVGL BasicUI");
  lv_obj_set_style_text_color(title, lv_color_hex(0xFFFFFF), 0);
  lv_obj_set_style_text_font(title, LV_FONT_DEFAULT, 0);
  lv_obj_align(title, LV_ALIGN_TOP_MID, 0, 18);

  statusLabel = lv_label_create(screen);
  lv_label_set_text_fmt(statusLabel,
                        "RGB + GT911 + LVGL | PSRAM: %lu MB | Touch: %s",
                        static_cast<unsigned long>(ESP.getPsramSize() / (1024UL * 1024UL)),
                        touchOk ? "OK" : "OPEN");
  lv_obj_set_style_text_color(statusLabel, lv_color_hex(0xC8D8E4), 0);
  lv_obj_align(statusLabel, LV_ALIGN_TOP_MID, 0, 55);

  lv_obj_t *panel = lv_obj_create(screen);
  lv_obj_set_size(panel, 700, 310);
  lv_obj_align(panel, LV_ALIGN_CENTER, 0, 25);
  lv_obj_set_style_radius(panel, 16, 0);
  lv_obj_set_style_bg_color(panel, lv_color_hex(0x1C2E3A), 0);
  lv_obj_set_style_border_color(panel, lv_color_hex(0x3E92CC), 0);
  lv_obj_set_style_border_width(panel, 2, 0);

  lv_obj_t *hint = lv_label_create(panel);
  lv_label_set_text(hint, "Touch the button and move the slider.");
  lv_obj_set_style_text_color(hint, lv_color_hex(0xFFFFFF), 0);
  lv_obj_align(hint, LV_ALIGN_TOP_MID, 0, 18);

  lv_obj_t *button = lv_btn_create(panel);
  lv_obj_set_size(button, 220, 72);
  lv_obj_align(button, LV_ALIGN_TOP_MID, 0, 65);
  lv_obj_add_event_cb(button, buttonEvent, LV_EVENT_CLICKED, nullptr);

  lv_obj_t *buttonLabel = lv_label_create(button);
  lv_label_set_text(buttonLabel, "Tap me");
  lv_obj_center(buttonLabel);

  counterLabel = lv_label_create(panel);
  lv_obj_set_style_text_color(counterLabel, lv_color_hex(0xFFFFFF), 0);
  lv_obj_align(counterLabel, LV_ALIGN_TOP_MID, 0, 155);
  updateCounterLabel();

  lv_obj_t *slider = lv_slider_create(panel);
  lv_obj_set_width(slider, 520);
  lv_obj_align(slider, LV_ALIGN_TOP_MID, 0, 205);
  lv_slider_set_range(slider, 16, 255);
  lv_slider_set_value(slider, 255, LV_ANIM_OFF);
  lv_obj_add_event_cb(slider, sliderEvent, LV_EVENT_VALUE_CHANGED, nullptr);

  sliderLabel = lv_label_create(panel);
  lv_label_set_text(sliderLabel, "Backlight PWM: 255 / 255");
  lv_obj_set_style_text_color(sliderLabel, lv_color_hex(0xFFFFFF), 0);
  lv_obj_align(sliderLabel, LV_ALIGN_TOP_MID, 0, 245);

  touchLabel = lv_label_create(screen);
  lv_label_set_text(touchLabel, "Touch raw bridge: waiting for GT911 packets");
  lv_obj_set_style_text_color(touchLabel, lv_color_hex(0x8DA9C4), 0);
  lv_obj_align(touchLabel, LV_ALIGN_BOTTOM_MID, 0, -32);

  lv_obj_t *footer = lv_label_create(screen);
  lv_label_set_text(footer, "10_LVGL_BasicUI: first local HMI shell, not Widget Runtime yet");
  lv_obj_set_style_text_color(footer, lv_color_hex(0x8DA9C4), 0);
  lv_obj_align(footer, LV_ALIGN_BOTTOM_MID, 0, -12);

  touchMarker = lv_obj_create(screen);
  lv_obj_set_size(touchMarker, 26, 26);
  lv_obj_set_style_radius(touchMarker, LV_RADIUS_CIRCLE, 0);
  lv_obj_set_style_bg_color(touchMarker, lv_color_hex(0xFF3366), 0);
  lv_obj_set_style_bg_opa(touchMarker, LV_OPA_COVER, 0);
  lv_obj_set_style_border_width(touchMarker, 2, 0);
  lv_obj_set_style_border_color(touchMarker, lv_color_hex(0xFFFFFF), 0);
  lv_obj_clear_flag(touchMarker, LV_OBJ_FLAG_CLICKABLE);
  lv_obj_clear_flag(touchMarker, LV_OBJ_FLAG_SCROLLABLE);
  lv_obj_add_flag(touchMarker, LV_OBJ_FLAG_HIDDEN);

  uiOk = true;
  Serial.println("[PASS] LVGL UI objects created");
}

static void updateTouchUi(int screenX, int screenY, int rawX, int rawY, uint8_t trackId, uint16_t touchSize) {
  if (!uiOk) {
    return;
  }

  if (touchLabel) {
    lv_label_set_text_fmt(touchLabel,
                          "Touch #%lu raw=%d,%d screen=%d,%d track=%u size=%u",
                          static_cast<unsigned long>(touchReports),
                          rawX,
                          rawY,
                          screenX,
                          screenY,
                          static_cast<unsigned int>(trackId),
                          static_cast<unsigned int>(touchSize));
  }

  if (touchMarker) {
    lv_obj_clear_flag(touchMarker, LV_OBJ_FLAG_HIDDEN);
    lv_obj_set_pos(touchMarker, screenX - 13, screenY - 13);
    markerVisible = true;
  }
}

static void hideTouchMarkerIfReleased(uint32_t now) {
  if (!markerVisible || !touchMarker) {
    return;
  }

  if (now - lastTouchSeenMs > 600) {
    lv_obj_add_flag(touchMarker, LV_OBJ_FLAG_HIDDEN);
    markerVisible = false;
  }
}

