AIDevelopersMonster/ESP32-8048S043-lab/libraries/ESP32_8048S043/examples/10_LVGL_BasicUI/10_LVGL_BasicUI.ino
static void pollTouchHardware() {
  if (!touchOk) {
    return;
  }

  const uint32_t now = millis();
  if (now - lastTouchPollMs < TOUCH_POLL_INTERVAL_MS) {
    return;
  }
  lastTouchPollMs = now;

  int16_t rawX = 0;
  int16_t rawY = 0;
  uint8_t trackId = 0;
  uint16_t touchSize = 0;
  uint8_t status = 0;

  if (readTouchRaw(rawX, rawY, trackId, touchSize, status)) {
    int screenX = 0;
    int screenY = 0;
    mapTouchToScreen(static_cast<uint16_t>(rawX), static_cast<uint16_t>(rawY), screenX, screenY);

    cachedTouchX = screenX;
    cachedTouchY = screenY;
    cachedTouchPressed = true;
    lastTouchSeenMs = now;
    ++touchReports;

    const int dx = lastRawX < 0 ? 999 : abs(static_cast<int>(rawX) - lastRawX);
    const int dy = lastRawY < 0 ? 999 : abs(static_cast<int>(rawY) - lastRawY);
    const bool movedEnough = dx > 2 || dy > 2;

    if ((now - lastTouchLogMs >= TOUCH_LOG_INTERVAL_MS) || movedEnough) {
      lastTouchLogMs = now;
      Serial.printf("[TOUCH] #%lu status=0x%02X track=%u raw_x=%d raw_y=%d screen_x=%d screen_y=%d size=%u\n",
                    static_cast<unsigned long>(touchReports),
                    status,
                    static_cast<unsigned int>(trackId),
                    rawX,
                    rawY,
                    screenX,
                    screenY,
                    static_cast<unsigned int>(touchSize));
    }

    updateTouchUi(screenX, screenY, rawX, rawY, trackId, touchSize);
    lastRawX = rawX;
    lastRawY = rawY;
  } else {
    if (cachedTouchPressed && (now - lastTouchSeenMs > TOUCH_HOLD_MS)) {
      cachedTouchPressed = false;
    }
    hideTouchMarkerIfReleased(now);
  }
}

void setup() {
  Serial.begin(SERIAL_BAUD);
  delay(1500);

  Serial.println();
  Serial.println("============================================================");
  Serial.println(" ESP32-8048S043 Lab / 10_LVGL_BasicUI");
  Serial.println(" LVGL 8 basic UI validation");
  Serial.println("============================================================");
  Serial.println("Author : Alex Malachevsky");
  Serial.println("GitHub : https://github.com/AIDevelopersMonster/ESP32-8048S043-lab");
  Serial.println("----------------------------------------------------------------");
  Serial.println("Mode   : RGB display + direct GT911 poll bridge + LVGL button/slider");
  Serial.println("Target : first local HMI shell after low-level hardware tests");
  Serial.println("Serial : 115200 baud");
  Serial.println("----------------------------------------------------------------");

  printBuildProfile();
  printDivider();
  printRuntimeBaseline();
  printDivider();

  displayOk = initDisplay();
  if (!displayOk) {
    Serial.println("[FATAL] Display init failed; LVGL test stopped");
    return;
  }

  printDivider();
  touchOk = initTouch();

  printDivider();
  lvglOk = initLvgl();
  if (!lvglOk) {
    Serial.println("[FATAL] LVGL init failed; LVGL test stopped");
    return;
  }

  createUi();

  Serial.println();
  Serial.println("============================================================");
  Serial.println(" LVGL BASIC UI READY");
  Serial.println(" Touch the screen. Serial should print [TOUCH] lines first.");
  Serial.println(" Then try the Tap me button and backlight slider.");
  Serial.println("============================================================");
}

void loop() {
  const uint32_t now = millis();

  if (lvglOk) {
    pollTouchHardware();

    const uint32_t elapsed = now - lastLvTickMs;
    if (elapsed >= LVGL_TICK_PERIOD_MS) {
      lv_tick_inc(elapsed);
      lastLvTickMs = now;
    }

    lv_timer_handler();
    ++lvglLoops;
  }

  if (now - lastAliveMs >= ALIVE_INTERVAL_MS) {
    lastAliveMs = now;
    Serial.printf("[ALIVE] uptime=%lus display=%s touch=%s lvgl=%s ui=%s clicks=%lu touchReports=%lu statusReads=%lu ready=%lu lastStatus=0x%02X i2cFail=%lu pointFail=%lu lvglLoops=%lu freeHeap=%lu psram=%lu freePsram=%lu\n",
                  static_cast<unsigned long>(now / 1000),
                  displayOk ? "OK" : "FAIL",
                  touchOk ? "OK" : "OPEN",
                  lvglOk ? "OK" : "FAIL",
                  uiOk ? "OK" : "FAIL",
                  static_cast<unsigned long>(buttonClicks),
                  static_cast<unsigned long>(touchReports),
                  static_cast<unsigned long>(touchStatusReads),
                  static_cast<unsigned long>(touchStatusReady),
                  static_cast<unsigned int>(lastTouchStatus),
                  static_cast<unsigned long>(touchStatusReadFails),
                  static_cast<unsigned long>(touchPointReadFails),
                  static_cast<unsigned long>(lvglLoops),
                  static_cast<unsigned long>(ESP.getFreeHeap()),
                  static_cast<unsigned long>(ESP.getPsramSize()),
                  static_cast<unsigned long>(ESP.getFreePsram()));
  }

  delay(5);
}
